:PROPERTIES:
:ID:       16812a77-d5ba-4b8c-9bf8-4bae6d3d520d
:END:
Consider using file vars like: ~# -*- org-use-tag-inheritance: nil; -*-~
Information to prep for interview questions related to data structures and algorithms and SE in general.
Use seprate elisp tangle vars for test code and regular code, set to either yes or no.
Most testing frameworks and libs seem to block stdout by default and getting results to show up can be finicky.
Set separate tangled filenames or dirs for test code.
* Query before eval examples
#+begin_src shell :eval (if (y-or-n-p "Run op1?") "yes" "no") :dir ~/ :results value
  thunar .
#+end_src

#+RESULTS:
: 0

#+begin_src shell :eval (my/query) :wrap "src shell"
  echo "ls"
#+end_src

#+RESULTS:
#+begin_src shell
ls
#+end_src

#+RESULTS:
| README.org  |
| README.org~ |

